package mini_project.utils;

public class ControlStatUtils {
	public static void printControlStatMenu() {
		System.out.println("===========================================< 이용상태관리 >=============================================");
		System.out.println("                ┌───────────────────┐  ┌───────────────────┐  ┌───────────────────┐                  ");
		System.out.println("                │    1. 이용시작    │  │    2. 일시정지    │  │    3. 이용종료    │                  ");
		System.out.println("                └───────────────────┘  └───────────────────┘  └───────────────────┘                  ");
		System.out.println("                ┌───────────────────┐  ┌───────────────────┐  ┌───────────────────┐                  ");
		System.out.println("                │      4. 이 전     │  │     5. 다 음      │  │    6. 로그아웃    │                  ");
		System.out.println("                └───────────────────┘  └───────────────────┘  └───────────────────┘                  ");
		System.out.println("=====================================================================================================");
		System.out.print("메뉴를 선택하세요. > ");
	}
}
