package mini_project.utils;

public class LoginUtils {
	public static void printLoginMenu() {
		System.out.println("===========================================< 로 그 인 >==============================================");
		System.out.println("    ┌───────────────────┐  ┌───────────────────┐  ┌───────────────────┐  ┌───────────────────┐      ");
		System.out.println("    │      1. 회 원     │  │     2. 비회원     │  │     3. 관리자     │  │     4. 이 전      │      ");
		System.out.println("    └───────────────────┘  └───────────────────┘  └───────────────────┘  └───────────────────┘      ");
		System.out.println("=====================================================================================================");
		System.out.print("메뉴를 선택하세요. > ");
	}
	
	
}
