package mini_project.utils;

public class PayUtils {
	public static void printPayMenu() {
		System.out.println("===========================================< 요금결제 >==============================================");
		System.out.println("                ┌───────────────────┐  ┌───────────────────┐  ┌───────────────────┐                  ");
		System.out.println("                │    1. 시간선택    │  │     2. 다 음      │  │    3. 로그아웃    │                  ");
		System.out.println("                └───────────────────┘  └───────────────────┘  └───────────────────┘                  ");
		System.out.println("=====================================================================================================");
		System.out.print("메뉴를 선택하세요. > ");
	}

}
